{
  "categories": {
    "Favorite Things": [
      "What's your favorite book and why?",
      "What's your favorite movie genre?",
      "What's your favorite place you've ever visited?",
      "What's your favorite type of cuisine?",
      "What's your favorite song?",
      "What's your favorite TV show?",
      "What's your favorite way to spend a day off?",
      "What's your favorite season and why?",
      "What's your favorite holiday?",
      "What's your favorite hobby?",
      "What's your favorite type of dessert?",
      "What's your favorite childhood movie?",
      "What's your favorite board game?",
      "What's your favorite type of flower?",
      "What's your favorite sport to watch?"
    ],
    "Life Experiences": [
      "What's a memorable trip or vacation you've taken?",
      "Have you ever had a life-changing experience? What was it?",
      "What's the most spontaneous thing you've ever done?",
      "What's the best advice you've ever received?",
      "What's your most cherished childhood memory?",
      "What's a skill you've always wanted to learn?",
      "What's the hardest challenge you've ever faced?",
      "What's an achievement you're really proud of?",
      "Have you ever met anyone famous?",
      "What's a funny or embarrassing story from your past?",
      "What's a significant event that shaped who you are?",
      "What's the most adventurous thing you've ever done?",
      "What's a moment in your life you wish you could relive?",
      "What's the biggest risk you've ever taken?",
      "What's something you've done that you never thought you would?"
    ],
    "Personal Preferences": [
      "Are you a morning person or a night owl?",
      "Do you prefer the beach or the mountains?",
      "What's your ideal way to spend a weekend?",
      "Do you like to plan things out or be spontaneous?",
      "Do you prefer dogs or cats?",
      "What's your favorite type of music?",
      "Do you prefer coffee or tea?",
      "What's your favorite type of movie?",
      "What's your favorite type of weather?",
      "Do you prefer to read books or watch movies?",
      "Do you prefer sweet or savory snacks?",
      "What's your favorite type of clothing to wear?",
      "Do you prefer to travel by plane, train, or car?",
      "What's your favorite time of day?",
      "Do you prefer big cities or small towns?"
    ],
    "Hobbies and Interests": [
      "What hobbies or activities are you passionate about?",
      "Do you have any hidden talents or skills?",
      "If you could learn a new skill instantly, what would it be?",
      "What's your favorite way to relax?",
      "Do you play any musical instruments?",
      "What's a hobby you've always wanted to try?",
      "Do you enjoy any sports or physical activities?",
      "What's a craft or DIY project you've done?",
      "Do you like to cook or bake?",
      "What's your favorite type of exercise?",
      "Do you enjoy reading? If so, what genres?",
      "What's a collection you have or would like to start?",
      "Do you enjoy gardening or growing plants?",
      "What's your favorite way to spend time outdoors?",
      "Do you enjoy playing video games or board games?"
    ],
    "Dreams and Aspirations": [
      "What's a goal or dream you're currently working towards?",
      "If you could live anywhere in the world, where would it be?",
      "What's something you've always wanted to try but haven't yet?",
      "Where do you see yourself in five years?",
      "What's your dream job?",
      "If you could start your own business, what would it be?",
      "What's a new year's resolution you've made and kept?",
      "If you could have any career, what would it be?",
      "What's a personal milestone you're proud of?",
      "If you could change one thing about your life, what would it be?",
      "What's your biggest aspiration in life?",
      "If you could make a significant impact on the world, how would you do it?",
      "What's a dream you had as a child that you still hold?",
      "If you could write a book, what would it be about?",
      "What's your vision for a perfect life?"
    ],
    "Fun and Light-hearted": [
      "What's the funniest thing that has ever happened to you?",
      "If you could have any superpower, what would it be?",
      "What's your go-to karaoke song?",
      "What's the weirdest food you've ever tried?",
      "If you could be any animal, what would you be and why?",
      "What's your favorite joke?",
      "If you could time travel, where would you go?",
      "What's the most ridiculous thing you've ever done?",
      "If you could swap lives with someone for a day, who would it be?",
      "What's your favorite game to play?",
      "What's your favorite comic book or cartoon character?",
      "If you could have a dinner party with fictional characters, who would you invite?",
      "What's the silliest thing you believed as a child?",
      "If you could be invisible for a day, what would you do?",
      "What's your favorite holiday tradition?"
    ],
    "Hypothetical Questions": [
      "If you could have dinner with any three people, dead or alive, who would they be?",
      "If you won the lottery, what's the first thing you would do?",
      "If you could time travel, would you go to the past or the future? Why?",
      "If you were stranded on a deserted island, what three items would you want with you?",
      "If you could switch lives with anyone for a day, who would it be?",
      "If you could instantly become an expert in something, what would it be?",
      "If you could live in any fictional world, which one would you choose?",
      "If you could have any job in the world, what would it be?",
      "If you could change one thing about the world, what would it be?",
      "If you could meet any fictional character, who would it be?",
      "If you could have any animal as a pet, what would it be?",
      "If you could travel to any planet, which one would you choose?",
      "If you could master any instrument, what would it be?",
      "If you could have any piece of art in your home, what would it be?",
      "If you could live in any historical period, which one would you choose?"
    ],
    "Values and Beliefs": [
      "What's something you strongly believe in?",
      "How do you handle stress or difficult situations?",
      "What's a cause or issue you're passionate about?",
      "How do you define success?",
      "What values are most important to you?",
      "What's a principle you try to live by?",
      "How do you stay motivated?",
      "What's your philosophy on life?",
      "How do you approach making difficult decisions?",
      "What's something you think everyone should experience at least once?",
      "What role does spirituality or religion play in your life?",
      "How do you practice self-care?",
      "What does integrity mean to you?",
      "How do you approach forgiveness?",
      "What's your perspective on giving back to the community?"
    ],
    "Technology and Innovation": [
      "What's your favorite gadget or piece of technology?",
      "What technological advancement are you most excited about?",
      "What's your favorite app on your phone or computer?",
      "Do you use any smart home devices? If so, which ones?",
      "How do you feel about our increasing dependency on technology?",
      "What's your favorite piece of retro technology?",
      "How do you think technology will change in the next 10 years?",
      "Do you prefer Apple or Android devices?",
      "What's a tech-related skill you wish you had?",
      "What's your opinion on artificial intelligence?",
      "How has technology improved your life?",
      "What's your favorite social media platform and why?",
      "How do you manage your screen time?",
      "What's your favorite online game or activity?",
      "What's the most useful app you've ever downloaded?"
    ],
    "Travel and Adventure": [
      "What's your dream travel destination?",
      "What's the most adventurous activity you've ever done?",
      "Who would you choose as your ideal travel companion?",
      "What's a cultural experience you'd love to have?",
      "What are three items you always pack for a trip?",
      "What's the best trip you've ever taken?",
      "Do you prefer solo travel or traveling with others?",
      "What's the most beautiful place you've ever seen?",
      "What's a travel destination you wouldn't visit again?",
      "What's your favorite travel memory?",
      "What's your top travel tip?",
      "How do you plan your trips?",
      "What's the longest trip you've ever taken?",
      "Do you prefer road trips or flying?",
      "What's your favorite souvenir you've brought back from a trip?"
    ],
    "Food and Drink": [
      "Do you have a signature dish you love to cook?",
      "What's your favorite restaurant and why?",
      "What's a culinary skill you wish you had?",
      "What's your favorite beverage, alcoholic or non-alcoholic?",
      "What's the most interesting food experiment you've tried?",
      "What's your favorite comfort food?",
      "Do you prefer cooking at home or dining out?",
      "What's your favorite international cuisine?",
      "What's the best meal you've ever had?",
      "Do you have any dietary restrictions or preferences?",
      "What's your favorite type of cake?",
      "Do you enjoy spicy food?",
      "What's your favorite type of sandwich?",
      "Do you prefer sweet or savory breakfasts?",
      "What's your go-to snack?"
    ],
    "Creativity and Expression": [
      "What's your favorite creative outlet?",
      "What's your favorite form of art?",
      "What's a creative project you're currently working on or have completed?",
      "Where do you find inspiration for your creativity?",
      "If you could master any artistic skill, what would it be?",
      "Do you enjoy writing? If so, what do you like to write?",
      "What's your favorite type of dance?",
      "Do you enjoy attending art galleries or museums?",
      "What's your favorite craft supply or tool?",
      "What's a memorable piece of art or craft you've created?",
      "What's your favorite book, movie, or show for creative inspiration?",
      "Do you prefer traditional art or digital art?",
      "What's your favorite medium to work with?",
      "Do you collaborate with others on creative projects?",
      "What's a new creative hobby you'd like to try?"
    ]
  }
}
